Python 3.10.0 (tags/v3.10.0:b494f59, Oct  4 2021, 19:00:18) [MSC v.1929 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
#описание себя, используя список

family=[
    [Ведерникова Ксения Александровна,Пермь, Плеханова, 8 из 17, 2, 3],
    [Ведерникова В.Н. Пермь, Плеханова, 8 из 17, 2, 3],
    [Ведерникова Я.В., Плеханова, 8 из 17, 2, 3]
]

family2={
    ('Ведерникова Ксения Александровна'):
        {'место жительства': Пермь, 
        'ул.': Плеханова,
        'этаж': 8 из 17,
        'кол-во ком.': 2,
        'кол-во членов в семье': 3},
    ('Ведерников В.Н.'):
        {'место жительства': Пермь, 
        'ул.': Плеханова,
        'этаж': 8 из 17,
        'кол-во ком.': 2,
        'кол-во членов в семье': 3},
    ('Ведерникова Я.В.'):
        {'место жительства': Пермь, 
        'ул.': Плеханова,
        'этаж': 8 из 17,
        'кол-во ком.': 2,
        'кол-во членов в семье': 3},
}